tap "aws/tap"
tap "hashicorp/tap"
tap "warrensbox/tap"

brew "awscli"
brew "basedpyright"
brew "difftastic"
brew "direnv"
brew "docker"
brew "elm"
brew "fastmod"
brew "fzf"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "httpie"
brew "jo"
brew "jq"
brew "lazygit"
brew "neovim"
brew "node"
brew "openjdk"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "ruff"
brew "rust-analyzer"
brew "rustup"
brew "sd"
brew "starship"
brew "tealdeer"
brew "tfsec"
brew "tmux"
brew "uv"
brew "wasm-pack"
brew "wget"
brew "yq"

brew "hashicorp/tap/terraform-ls"
brew "warrensbox/tap/tfswitch"

cask "alacritty"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-monaspace-nerd-font"

instance_eval(File.read("#{ENV['HOME']}/dotfiles/secrets/Brewfile")) if File.exist?("#{ENV['HOME']}/dotfiles/secrets/Brewfile")
