tap "aws/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "salesforce/cloudsplaining", "https://github.com/salesforce/cloudsplaining"
tap "warrensbox/tap"
brew "openssl@1.1"
brew "ansible"
brew "awscli"
brew "elm"
brew "fastmod"
brew "fzf"
brew "git"
brew "git-delta"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "openjdk"
brew "gradle"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "node"
brew "pyenv"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rustup"
brew "sd"
brew "starship"
brew "tealdeer"
brew "tfsec"
brew "tmux"
brew "heroku/brew/heroku"
brew "salesforce/cloudsplaining/cloudsplaining"
brew "warrensbox/tap/tfswitch"
cask "1password"
cask "alacritty"
cask "alfred"
cask "brave-browser"
cask "docker"
cask "dropbox"
cask "fantastical"
cask "firefox"
cask "font-fira-code"
cask "goland"
cask "intellij-idea-ce"
cask "keybase"
cask "postico"
cask "slack"
cask "spotify"
cask "tuple"
cask "typora"
cask "zoomus"
